namespace DoINeedUmbrellaToday.Localization
{
    /// <summary>
    /// Вариант локализатора бота для русского языка
    /// </summary>
    public class BotLocalizerRu : BotLocalizer
    {
        protected override Dictionary<string, string> Library { get; } = new Dictionary<string, string>()
        {
            {"weather:1", "Малооблачно" },
            {"weather:2 ", "Облачно"},
            {"weather:3", "Пасмурно"},
            {"weather:45" , "Туман"},
            {"weather:48" , "Изморозь"},
            {"weather:51" , "Легкая морось"},
            {"weather:53" , "Умеренная морось"},
            {"weather:55" , "Сильная морось"},
            {"weather:56" , "Холодная морось"},
            {"weather:57" , "Легкая морось"},
            {"weather:61" , "Небольшой дождь"},
            {"weather:63" , "Умеренный дождь"},
            {"weather:65" , "Сильный дождь"},
            {"weather:66" , "Холодный дождь"},
            {"weather:67" , "Сильный холодный дождь"},
            {"weather:71" , "Легкий снег"},
            {"weather:73" , "Умеренный снег"},
            {"weather:75" , "Сильный снег"},
            {"weather:77" , "Снег"},
            {"weather:80" , "Ливень"},
            {"weather:81" , "Умеренный ливень"},
            {"weather:82" , "Сильный ливень"},
            {"weather:85" , "Снегопад"},
            {"weather:86" , "Сильный снегопад"},
            {"weather:95" , "Умеренный шторм"},
            {"weather:96" , "Град"},
            {"weather:99" , "Сильный град"},
            {"weather:0", "Ясно" },
            {"langSelected", "Будем говорить с вами на Русском! Введите название города и мы его найдем"},
            {"welcome", "Привет, {0}! Выберите язык"},
            {"citySelected", "Отлично! Мы знаем где вы живете. Напишите \"Погода\" и мы вам о ней расскажем" },
            {"cityNotFound", "Извините, мы не нашли ваш город. Попробуйте ввести его название немного иначе"},
            {"cityRequest", "Введите название вашего города и мы его найдем" },
            {"cityBad", "Этот город точно существует? Попробуйте снова"},
            {"cityFound", "Мы нашли ваш город! \r\n\r\n Это *{0}*\r\n в регионе\r\n *{1}*\r\n страны *{2}*?" },
            {"weatherTemplate", "Погода"},
            {"theWeather", "Сегодня в городе *{0}*: \r\n {1}{2} \r\n {3}! \r\n Температура воздуха ожидается в пределах от *{4}* до *{5}* градусов" },
            {"umbrellaTrue", "*Не забудьте взять зонт ☔*" },
            {"umbrellaFalse", "*Зонт можете не брать ☂*" },
        };

        protected override string FallbackValue => "Текст не найден";
    }
}
